# -----------------CPU-----------------
# CPU: CPU는 중앙 처리 장치로서, 컴퓨터에서 명령어를 실행하고 데이터를 처리하는 핵심 구성 요소입니다. 
# CPU는 프로그램의 명령어를 해석하고 실행하여 연산을 수행하며, 제어 장치와 산술/논리 장치로 구성됩니다. 
# CPU는 주기적으로 Main Memory에서 명령어와 데이터를 가져와 처리하고, 결과를 다시 Main Memory에 저장합니다.

# -----------------Main Memory-----------------
# Main Memory: Main Memory는 프로그램이 실행되는 동안 데이터와 명령어를 저장하는 주 기억 장치입니다. 
# CPU가 Main Memory에서 데이터와 명령어를 읽고 쓰므로, 프로그램의 실행에 필요한 데이터를 임시로 저장하는 역할을 합니다. 
# 주로 랜덤 액세스 메모리(RAM) 형태로 구현되며, 데이터와 명령어를 비롯한 프로그램의 실행에 필요한 모든 정보를 보유합니다.

# -----------------Secondary Memory-----------------
# Secondary Memory: Secondary Memory는 보조 기억 장치로서, 주로 하드 디스크 드라이브(HDD), SSD(Solid State Drive), CD/DVD 등을 포함합니다. 
# Secondary Memory는 비휘발성이기 때문에 데이터를 오랜 기간 동안 보존할 수 있습니다. 
# 주로 데이터의 장기 저장 및 백업 용도로 사용되며, 프로그램 파일, 사용자 파일, 운영 체제 등이 Secondary Memory에 저장됩니다. 
# CPU는 필요한 데이터를 Main Memory로부터 가져와서 Secondary Memory에 저장된 데이터를 읽거나 쓸 수 있습니다.